# InfrastructureAlignmentDisplayedStartStation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InfrastructureAlignmentDisplayedStartStation Property
ParameterTypeId Class See Also
---
"Displayed Start Station"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InfrastructureAlignmentDisplayedStartStation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfrastructureAlignmentDisplayedStartStation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InfrastructureAlignmentDisplayedStartStation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace